InformationRegisters/НастройкиРаспределенияПостатейныхРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НастройкиРаспределенияПостатейныхРасходов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкаУпр</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РаспределениеПрочихЗатрат</v8:Type>
						<v8:Type>cfg:CatalogRef.ПравилаРаспределенияРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРегл</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РаспределениеПрочихЗатрат</v8:Type>
						<v8:Type>cfg:CatalogRef.ПравилаРаспределенияРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаНУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаРаспределенияРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиРаспределенияПостатейныхРасходов/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если (Параметры.Свойство("СтатьяРасходов")) Тогда
		СтатьяРасходовФильтр = Параметры.СтатьяРасходов;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "СтатьяРасходов", СтатьяРасходовФильтр);
		Заголовок = Строка(СтатьяРасходовФильтр);
		Элементы.НастройкаУпр.Заголовок =	Строка(СтатьяРасходовФильтр.ВариантРаспределенияРасходовУпр);
		Элементы.НастройкаРегл.Заголовок =	Строка(СтатьяРасходовФильтр.ВариантРаспределенияРасходовРегл);
		Элементы.НастройкаНУ.Заголовок =	Строка(СтатьяРасходовФильтр.ВариантРаспределенияРасходовНУ);
	КонецЕсли;
	
	ЭтоФормаНастройкиСтатьи = ЗначениеЗаполнено(СтатьяРасходовФильтр);
	
	// Видимость колонок
	Элементы.СтатьяРасходов.Видимость = НЕ ЭтоФормаНастройкиСтатьи;
	Элементы.СтатьяРасходовВариантРаспределенияРасходовУпр.Видимость =	НЕ ЭтоФормаНастройкиСтатьи;
	Элементы.СтатьяРасходовВариантРаспределенияРасходовРегл.Видимость =	НЕ ЭтоФормаНастройкиСтатьи;
	Элементы.СтатьяРасходовВариантРаспределенияРасходовНУ.Видимость =	НЕ ЭтоФормаНастройкиСтатьи;
	Элементы.НастройкаУпр.ОтображатьВШапке =	ЭтоФормаНастройкиСтатьи;
	Элементы.НастройкаРегл.ОтображатьВШапке =	ЭтоФормаНастройкиСтатьи;
	Элементы.НастройкаНУ.ОтображатьВШапке =	ЭтоФормаНастройкиСтатьи;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	Оповестить("ИзмененыНастройкиРаспределенияПостатейныхРасходов");
КонецПроцедуры
